app/views/home/_header.html.erb

SELECT "categories".* FROM "categories"
---
        <div class="dropdown-menu" aria-labelledby="navbarDropdown">
          <% Category.all.each do |category|%>