app/controllers/products_controller.rb

  def index
    @products = Product.search(params[:search]).paginate(:page => params[:page], :per_page => 3).order("created_at DESC")
---
SELECT "products".* FROM "products" WHERE (title  LIKE '%dareu%') ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE (title  LIKE '%%')

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("sku", "title", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sku", "2435467576"], ["title", "Iphone se 2020"], ["price", 12000000], ["quantity", 100], ["created_at", "2021-11-15 09:35:35.488793"], ["updated_at", "2021-11-15 09:35:35.488793"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "mi band 6"], ["updated_at", "2021-11-15 10:22:42.224045"], ["id", 7]]