app/controllers/types_controller.rb

    def set_type
      @type = Type.find(params[:id])
---
SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]