app/controllers/users_controller.rb

   def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "password", "birthday", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "tim@mail.com"], ["password", "123qweasd"], ["birthday", "2000-12-12"], ["phone", 142352456], ["created_at", "2021-11-30 06:49:21.302712"], ["updated_at", "2021-11-30 06:49:21.302712"]]