app/models/user.rb

    def check_user
        pass_hash = BCrypt::Password.create(password)
---
INSERT INTO "users" ("email", "password", "birthday", "phone", "created_at", "updated_at", "confirm_password") VALUES (?, ?, ?, ?, ?, ?, ?)