app/views/categories/show.html.erb

<h3>List product : </h3>
<% @category.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]