app/views/products/_form.html.erb

    <%= form.label :Category %>
    <%= form.collection_select :category_id, Category.all, :id, :name , class:"form-control" %>
---
SELECT "categories".* FROM "categories"