app/views/products/show.html.erb

   <strong>Type:</strong>
   <% @product.types.each do |type|%>
---
SELECT "types".* FROM "types" WHERE "types"."product_id" = ?  [["product_id", 1]]

     <%= image_tag(type.image) if type.image.present?%>
      <%type.properties.each do |property|%>
---
SELECT "properties".* FROM "properties" WHERE "properties"."type_id" = ?  [["type_id", 1]]